(function () {
    /**
     * Javascript 语法
     */

    /**
     * 2.1 准备工作
     *  - 普通的文本编辑器
     *  - WEB 浏览器
     */

    /**
     * 2.2 语法
     */

    /**
     * 2.2.1 语句
     */

    /**
     * 2.2.2 注释
     */

    /**
     * 2.2.3 变量
     */

    /**
     * 2.2.4 数据类型
     *  - 字符串
     *  - 数值
     *  - 布尔值
     */

    /**
     * 2.2.5 数组
     */

    /**
     * 2.2.6 对象
     */

    /**
     * 2.3 操作
     *  - 算数操作符
     */

    /**
     * 2.4 条件语句
     *  - 比较操作符
     *  - 逻辑操作符
     */

    /**
     * 2.5 循环语句
     *  - while/ do……while 循环
     *  - for
     */

    /**
     * 2.6 函数
     */

    /**
     * 2.7 对象
     *  - 内建对象
     *  - 宿主对象
     */
})();